// *++
	//
// Copyright (c) 2009, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution.  The full text of the license may be found at        
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   DriverHealthStrings.uni
// 
// Abstract:
// 
//   String definitions for Driver Health Protocol.
// 
// Revision History:
// 
// --*/


/=#

#langdef en-US "English"
#langdef fr-FR "Francais"

#string STR_HEALTHY_WARNING           #language en-US  "WARNING: The device is not operating at optimal performance."
                                      #language fr-FR  "WARNING: The device is not operating at optimal performance."
#string STR_FAILED_ERROR              #language en-US  "ERROR: The device has a critical HW failure and must be replaced."
                                      #language fr-FR  "ERROR: The device has a critical HW failure and must be replaced."
#string STR_REBOOT_REQUIRED           #language en-US  "STATUS: The platform need to be rebooted."
                                      #language fr-FR  "STATUS: The platform needs to be rebooted."
#string STR_RECONNECT_REQUIRED        #language en-US  "STATUS: The driver need to be reconnected."
                                      #language fr-FR  "STATUS: The driver need to be reconnected."
#string STR_REPAIR_REQUIRED           #language en-US  "WARNING: The device need to be repaired."
                                      #language fr-FR  "WARNING: The device need to be repaired."
#string STR_CONFIG_WARNING            #language en-US  "WARNING: The device must be reconfigured."
                                      #language fr-FR  "WARNING: The device must be reconfigured."
                                      
                                      
#string STR_CONFIG_CONTROLLER_LIST    #language en-US  "Disk Io Controller # "
                                      #language fr-FR  "fr-FR: Disk Io Controller # " 
#string STR_CONFIG_CONTROLLER_LIST_HELP #language en-US  "Please enter the controller number for maunaly specify controller to do configuration. Default is 0, means NO controller will be configed. Assume the controller will always config success if entered the num."
                                        #language fr-FR  "fr-FR: Please enter the controller number for maunaly specify controller to do configuration. Default is 0, means NO controller will be configed. Assume the controller will always config success if entered the num."   
                                                                           
#string STR_FORM_SET_TITLE            #language en-US  "Dummy DiskIo"
                                      #language fr-FR  "fr-FR: Dummy DiskIo"
#string STR_TITLE                     #language en-US  "This is Dummy Disk I/O Driver Health Check Test"
                                      #language fr-FR  "fr-FR: This is Dummy Disk I/O Driver Health Check Test"
#string STR_FORM_SET_TITLE_HELP       #language en-US  "Help"
                                      #language fr-FR  "Help"
                                      

